tap "anyzig/tap"

brew "anyzig"
brew "clang-format"
brew "direnv"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "git-delta"
brew "jq"
brew "mpv"
brew "neovim"
brew "nixfmt"
brew "pandoc"
brew "prettier"
brew "ripgrep"
brew "ruff"
brew "shfmt"
brew "stylua"
brew "tlrc"
brew "tree-sitter-cli"

if OS.mac?
  cask "ghostty"
  cask "signal"
  cask "spotify"
  cask "wezterm"
end
