brew "git"
brew "direnv"
brew "tlrc"
brew "lazygit"
brew "git-crypt"
brew "git-lfs"
brew "llvm"

# Neovim
brew "neovim", args: ["HEAD"]  # until 0.12 released
brew "luarocks"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "nixfmt"
brew "prettier"
brew "jq"
brew "ruff"

if OS.mac?
  brew "fish"
  cask "wezterm"
  cask "signal"
  cask "firefox"
  brew "go"
  go "tailscale.com/cmd/tailscale"
  go "tailscale.com/cmd/tailscaled"
end
