brew "fish"
brew "git"
brew "direnv"
brew "tlrc"
brew "lazygit"
brew "git-crypt"
brew "git-lfs"
brew "git-delta"
tap "anyzig/tap"
brew "anyzig"

# NEOVIM
brew "neovim", args: ["HEAD"]  # until 0.12 released
brew "tree-sitter-cli"
brew "fd"
brew "fzf"
brew "ripgrep"
# formatters
brew "shfmt"
brew "stylua"
brew "clang-format"
brew "nixfmt"
brew "prettier"
brew "jq"
brew "ruff"

if OS.mac?
  cask "wezterm"
  cask "signal"
  cask "librewolf"
  brew "go"
  go "tailscale.com/cmd/tailscale"
  go "tailscale.com/cmd/tailscaled"
end
